OpenFOAM-2.3.0/tutorials/incompressible/simpleFoam/airfoilBGInteraction/far/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        physicalType    inlet;
        nFaces          134;
        startFace       11689;
    }
    outlet
    {
        type            patch;
        physicalType    outlet;
        nFaces          86;
        startFace       11823;
    }
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        inGroups        1(empty);
        nFaces          11882;
        startFace       11909;
    }
    coupled
    {
        type            patch;
        nFaces          166;
        startFace       23791;
    }
)

// ************************************************************************* //
