OpenFOAM-2.3.0/tutorials/incompressible/simpleFoam/airfoilBGInteraction/far/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(


    {
        name    potential;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-30 -20 0)(237 20 0.05);
        }
    }

    {
        name    potential;
        type    cellSet;
        action  invert;
    }
);

// ************************************************************************* //
